In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
print(df.columns)

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
df['FamilySize'] = df['SibSp'] + df['Parch'] + 1
df['IsAlone']=0
df.loc[df['FamilySize']==1, 'IsAlone']=1

In [8]:
df['Title'] = df['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)
df['Title'] = df['Title'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')
title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}
df['Title'] = df['Title'].map(title_mapping)

<>:1: SyntaxWarning: invalid escape sequence '\.'
<>:1: SyntaxWarning: invalid escape sequence '\.'
C:\Users\Admin\AppData\Local\Temp\ipykernel_17800\2368586504.py:1: SyntaxWarning: invalid escape sequence '\.'
  df['Title'] = df['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)

In [9]:
df['Age'] = df['Age'].fillna(df['Age'].median())
df['AgeGroup'] = pd.cut(df['Age'], bins=[0, 12, 20, 60, 100], labels=['Child', 'Teen', 'Adult', 'Senior'])

In [10]:
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})
print(df[['FamilySize', 'IsAlone', 'Title', 'AgeGroup', 'Sex']].head())

   FamilySize  IsAlone  Title AgeGroup  Sex
0           1        1    1.0    Adult    0
1           2        0    3.0    Adult    1
2           1        1    1.0   Senior    0
3           1        1    1.0    Adult    0
4           3        0    3.0    Adult    1